# GetSolidsBeingCut Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SolidSolidCutUtils..::..GetSolidsBeingCut Method
SolidSolidCutUtils Class See Also
---
Get all the solids which are cut by the input element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public static ICollection<ElementId> GetSolidsBeingCut(
	Element element
)
```

Visual Basic
---
```text
Public Shared Function GetSolidsBeingCut ( _
	element As Element _
) As ICollection(Of ElementId)
```

Visual C++
---
```text
public:
static ICollection<ElementId^>^ GetSolidsBeingCut(
	Element^ element
)
```

# ### Parameters
element
    Type: Autodesk.Revit.DB..::..Element The input element.
# ### Return Value
The ids of the solids which are cut by the input element.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
SolidSolidCutUtils Class
Autodesk.Revit.DB Namespace